fed-ex/SampleTransactions_Rate/Rate Available Services.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://fedex.com/ws/rate/v14"><SOAP-ENV:Body><ns1:RateRequest><ns1:WebAuthenticationDetail><ns1:UserCredential><ns1:Key>"Input Your Information"</ns1:Key><ns1:Password>"Input Your Information"</ns1:Password></ns1:UserCredential></ns1:WebAuthenticationDetail><ns1:ClientDetail><ns1:AccountNumber>"Input Your Information"</ns1:AccountNumber><ns1:MeterNumber>"Input Your Information"</ns1:MeterNumber></ns1:ClientDetail><ns1:TransactionDetail><ns1:CustomerTransactionId> *** Rate Available Services Request v14 ***</ns1:CustomerTransactionId></ns1:TransactionDetail><ns1:Version><ns1:ServiceId>crs</ns1:ServiceId><ns1:Major>14</ns1:Major><ns1:Intermediate>0</ns1:Intermediate><ns1:Minor>0</ns1:Minor></ns1:Version><ns1:ReturnTransitAndCommit>true</ns1:ReturnTransitAndCommit><ns1:RequestedShipment><ns1:ShipTimestamp>2013-06-10T06:40:07+00:00</ns1:ShipTimestamp><ns1:DropoffType>REGULAR_PICKUP</ns1:DropoffType><ns1:Shipper><ns1:Address><ns1:StreetLines>10 Fed Ex Pkwy</ns1:StreetLines><ns1:City>Memphis</ns1:City><ns1:StateOrProvinceCode>TN</ns1:StateOrProvinceCode><ns1:PostalCode>38115</ns1:PostalCode><ns1:CountryCode>US</ns1:CountryCode></ns1:Address></ns1:Shipper><ns1:Recipient><ns1:Address><ns1:StreetLines>13450 Farmcrest Ct</ns1:StreetLines><ns1:City>Herndon</ns1:City><ns1:StateOrProvinceCode>VA</ns1:StateOrProvinceCode><ns1:PostalCode>20171</ns1:PostalCode><ns1:CountryCode>US</ns1:CountryCode></ns1:Address></ns1:Recipient><ns1:ShippingChargesPayment><ns1:PaymentType>SENDER</ns1:PaymentType><ns1:Payor><ns1:ResponsibleParty><ns1:AccountNumber>"Input Your Information"</ns1:AccountNumber><ns1:Address><ns1:CountryCode>US</ns1:CountryCode></ns1:Address></ns1:ResponsibleParty></ns1:Payor></ns1:ShippingChargesPayment><ns1:RateRequestTypes>LIST</ns1:RateRequestTypes><ns1:PackageCount>2</ns1:PackageCount><ns1:RequestedPackageLineItems><ns1:SequenceNumber>1</ns1:SequenceNumber><ns1:GroupPackageCount>1</ns1:GroupPackageCount><ns1:Weight><ns1:Units>LB</ns1:Units><ns1:Value>2</ns1:Value></ns1:Weight><ns1:Dimensions><ns1:Length>10</ns1:Length><ns1:Width>10</ns1:Width><ns1:Height>3</ns1:Height><ns1:Units>IN</ns1:Units></ns1:Dimensions></ns1:RequestedPackageLineItems><ns1:RequestedPackageLineItems><ns1:SequenceNumber>2</ns1:SequenceNumber><ns1:GroupPackageCount>1</ns1:GroupPackageCount><ns1:Weight><ns1:Units>LB</ns1:Units><ns1:Value>5</ns1:Value></ns1:Weight><ns1:Dimensions><ns1:Length>20</ns1:Length><ns1:Width>20</ns1:Width><ns1:Height>10</ns1:Height><ns1:Units>IN</ns1:Units></ns1:Dimensions></ns1:RequestedPackageLineItems></ns1:RequestedShipment></ns1:RateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
